config/cf/Documents/ПланированиеБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ПланированиеБюджета</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.Задание</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Бюджеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторКорректировки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.АвторДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУчетаКоличества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКорректировки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПериодыБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланируемыйБюджет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бюджеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеПериодаБюджета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеПодразделения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоложениеСтатьиДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПоложениеРеквизитаНаФорме</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НДСВключатьВСтоимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Бюджеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПериодыБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходовРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.КарточкиНоменклатуры</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/cf/Enums/ПоложениеРеквизитаНаФорме.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ПоложениеРеквизитаНаФорме</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВШапке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВТабличнойЧасти</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

config/cf/Documents/ПланированиеБюджета/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ПоложениеСтатьиДоходовРасходов = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Для каждого СтрокаТабличнойЧасти Из Бюджеты Цикл
			СтрокаТабличнойЧасти.СтатьяДоходовРасходов = СтатьяДоходовРасходов;
		КонецЦикла;
	КонецЕсли;	
	
	Если ПоложениеПодразделения = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Для каждого СтрокаТабличнойЧасти Из Бюджеты Цикл
			СтрокаТабличнойЧасти.Подразделение = Подразделение;
		КонецЦикла;
	КонецЕсли;	
	
	Если ПоложениеПериодаБюджета = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Для каждого СтрокаТабличнойЧасти Из Бюджеты Цикл
			СтрокаТабличнойЧасти.ПериодБюджета = ПериодБюджета;
		КонецЦикла;
	КонецЕсли;	
	
	СуммаДокумента = Бюджеты.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Инициализация дополнительных свойств для проведения документа.
	УправлениеITОтделом8УФ.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Инициализация данных документа.
	СЛС.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	
	// Подготовка наборов записей.
	УправлениеITОтделом8УФ.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Отражение в разделах учета.
	СЛС.ОтразитьДвиженияВРазделахУчета(Ссылка, ДополнительныеСвойства, Движения, Отказ);	
	
	// Запись наборов записей.
	УправлениеITОтделом8УФ.ЗаписатьНаборыЗаписей(ЭтотОбъект);
		
	ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено Тогда
		Основание = ДанныеЗаполнения;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ПоложениеПериодаБюджета			= Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
		ПоложениеСтатьиДоходовРасходов			= ДанныеЗаполнения.ПоложениеСтатьиДоходовРасходов;
		СтатьяДоходовРасходов					= ДанныеЗаполнения.СтатьяДоходовРасходов;
		ПоложениеПодразделения			= ДанныеЗаполнения.ПоложениеПодразделения;
		Подразделение					= ДанныеЗаполнения.Подразделение;
		БезУчетаКоличества				= Ложь;
		Комментарий						= СтрШаблон(НСтр("ru = 'Планирование на основании заказа №%1 от %2'"), ДанныеЗаполнения.Номер, Формат(ДанныеЗаполнения.Дата, "ДФ=dd.MM.yyyy"));
		ПланируемыйБюджет				= ДанныеЗаполнения.Бюджет;
		ВалютаДокумента					= ДанныеЗаполнения.ВалютаДокумента;
		СуммаВключаетНДС				= ДанныеЗаполнения.СуммаВключаетНДС;
		
		Для Каждого Строки Из ДанныеЗаполнения.Номенклатура Цикл
			НоваяСтрока					= Бюджеты.Добавить();
			НоваяСтрока.ПериодБюджета 	= ДанныеЗаполнения.ПериодБюджета;
			НоваяСтрока.Подразделение 	= Строки.Подразделение;
			НоваяСтрока.ДатаОплаты	  	= ДанныеЗаполнения.Дата;
			НоваяСтрока.Количество		= Строки.Количество;
			НоваяСтрока.Цена			= ?(Строки.Количество = 0, 0, Строки.Всего / Строки.Количество);
			НоваяСтрока.СтатьяДоходовРасходов	= Строки.СтатьяДоходовРасходов;
			НоваяСтрока.Описание		= Строка(Строки.Номенклатура);
			НоваяСтрока.Сумма			= Строки.Сумма;
			НоваяСтрока.СтавкаНДС		= Строки.СтавкаНДС;
			НоваяСтрока.СуммаНДС		= Строки.СуммаНДС;
			НоваяСтрока.Всего 			= Строки.Всего;
		КонецЦикла;				
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Задание") Тогда
		
		ПоложениеПериодаБюджета			= Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
		ПоложениеПодразделения			= Перечисления.ПоложениеРеквизитаНаФорме.ВШапке;
		Подразделение					= ДанныеЗаполнения.Подразделение;
		БезУчетаКоличества				= Ложь;
		Комментарий						= СтрШаблон(НСтр("ru = 'Планирование на основании задания №%1 от %2'"), ДанныеЗаполнения.Номер, Формат(ДанныеЗаполнения.Дата, "ДФ=dd.MM.yyyy"));
		ПланируемыйБюджет				= УправлениеITОтделом8УФ.НайтиБюджетНаДату(ДанныеЗаполнения.Дата, ДанныеЗаполнения.Организация);
		
		НоваяСтрока						= Бюджеты.Добавить();
		НоваяСтрока.ПериодБюджета 		= УправлениеITОтделом8УФ.НайтиПериодБюджета(ДанныеЗаполнения.Дата, ПланируемыйБюджет);
		НоваяСтрока.Подразделение 		= Подразделение;
		НоваяСтрока.ДатаОплаты	  		= ДанныеЗаполнения.Дата;
		НоваяСтрока.Количество			= 1;
		НоваяСтрока.Описание			= ДанныеЗаполнения.Тема;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти	

#Область СлужебныеПроцедурыИФункции

// Проверка объекта на обязательные реквизиты перед проведением.
Процедура ПроверитьДокументПередПроведением(Отказ)
	
	Если НЕ ЗначениеЗаполнено(ПланируемыйБюджет) Тогда
		УправлениеITОтделом8УФ.СообщитьОбОшибке(ЭтотОбъект, НСтр("ru = 'Не указан планируемый бюджет'"), , , "ПланируемыйБюджет", Отказ);
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ПоложениеСтатьиДоходовРасходов) Тогда
		УправлениеITОтделом8УФ.СообщитьОбОшибке(ЭтотОбъект, НСтр("ru = 'Не указано положение статьи доходов и расходов (в шапке/в таблице)'"), , , "ПоложениеСтатьиДоходовРасходов", Отказ);
	КонецЕсли;
		
	Если ПоложениеСтатьиДоходовРасходов = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Если НЕ ЗначениеЗаполнено(СтатьяДоходовРасходов) Тогда
			УправлениеITОтделом8УФ.СообщитьОбОшибке(ЭтотОбъект, НСтр("ru = 'Не указана статья доходов и расходов'"), , , "СтатьяДоходовРасходов", Отказ);
		КонецЕсли;
	Иначе
		Для каждого СтрокаТабличнойЧасти Из Бюджеты Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтатьяДоходовРасходов) Тогда
				УправлениеITОтделом8УФ.СообщитьОбОшибке(ЭтотОбъект, НСтр("ru = 'Не указана статья доходов и расходов'"), "Бюджеты", СтрокаТабличнойЧасти.НомерСтроки, "СтатьяДоходовРасходов", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ПоложениеПериодаБюджета = Перечисления.ПоложениеРеквизитаНаФорме.ВШапке Тогда
		Если НЕ ЗначениеЗаполнено(ПериодБюджета) Тогда
			УправлениеITОтделом8УФ.СообщитьОбОшибке(ЭтотОбъект, НСтр("ru = 'Не указан период бюджета'"), , , "ПериодБюджета", Отказ);
		КонецЕсли;
	Иначе
		Для каждого СтрокаТабличнойЧасти Из Бюджеты Цикл
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтатьяДоходовРасходов) Тогда
				УправлениеITОтделом8УФ.СообщитьОбОшибке(ЭтотОбъект, НСтр("ru = 'Не указан период бюджета'"), "Бюджеты", СтрокаТабличнойЧасти.НомерСтроки, "ПериодБюджета", Отказ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
